РасширениеГТС/Джитиис/Documents/ТранспортнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТранспортнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументыОснования</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/InformationRegisters/РеестрДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеестрДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерДокументаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаДокументаИБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиРеестраДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/КорректировкаРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КорректировкаРеализации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидКорректировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПродажаПоЗаказам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипКорректировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорректировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасовОприходование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ВидЗапасов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерГТД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоПоРНПТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтавкаНДС</Name>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СкладОтгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаУчетаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВзаиморасчетов</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расхождения</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ТранспортнаяНакладная/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура асп_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//ТаблицаРеестрДокументов	= новый ТаблицаЗначений;
	//ТаблицаРеестрДокументов.Колонки.Добавить("Ссылка", новый ОписаниеТипов("ДокументССылка.ТранспортнаяНакладная, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("ДатаДокументаИБ", новый ОписаниеТипов("Дата, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("НомерДокументаИБ", новый ОписаниеТипов("Строка, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("ТипСсылки", новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("Организация", новый ОписаниеТипов("СправочникСсылка.Организации, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("Проведен", новый ОписаниеТипов("Булево, Null"));
	//ТаблицаРеестрДокументов.Колонки.Добавить("ПометкаУдаления", новый ОписаниеТипов("Булево, Null"));
	//Стр = ТаблицаРеестрДокументов.Добавить();
	//Стр.Ссылка = Ссылка;
	//Стр.ДатаДокументаИБ = Дата;
	//Стр.НомерДокументаИБ = Номер;
	//Стр.ТипСсылки = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Транспортная Накладная");
	//Стр.Организация = Организация;
	//Стр.Проведен = Проведен;
	//Стр.ПометкаУдаления = ПометкаУдаления;
	//Если ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") Тогда
	//	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрДокументов", ТаблицаРеестрДокументов);
	//Иначе
	//	ТаблицыДляДвижений = новый Структура;
	//	ТаблицыДляДвижений.Вставить("ТаблицаРеестрДокументов", ТаблицаРеестрДокументов);
	//	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);	
	//КонецЕсли;
	//
	//РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
КонецПроцедуры

&После("ПриЗаписи")
Процедура асп_ПриЗаписи(Отказ)
	ТаблицаРеестрДокументов	= новый ТаблицаЗначений;
	ТаблицаРеестрДокументов.Колонки.Добавить("Ссылка", новый ОписаниеТипов("ДокументССылка.ТранспортнаяНакладная, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("ДатаДокументаИБ", новый ОписаниеТипов("Дата, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("НомерДокументаИБ", новый ОписаниеТипов("Строка, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("ТипСсылки", новый ОписаниеТипов("СправочникСсылка.ИдентификаторыОбъектовМетаданных, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Организация", новый ОписаниеТипов("СправочникСсылка.Организации, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Проведен", новый ОписаниеТипов("Булево, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("ПометкаУдаления", новый ОписаниеТипов("Булево, Null"));
	
	ТаблицаРеестрДокументов.Колонки.Добавить("Ответственный", новый ОписаниеТипов("СправочникСсылка.Пользователи, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Подразделение", новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Контрагент", новый ОписаниеТипов("СправочникСсылка.Контрагенты, Null"));
	ТаблицаРеестрДокументов.Колонки.Добавить("Партнер", новый ОписаниеТипов("СправочникСсылка.Партнеры, Null"));
	
	Стр = ТаблицаРеестрДокументов.Добавить();
	Стр.Ссылка = Ссылка;
	Стр.ДатаДокументаИБ = Дата;
	Стр.НомерДокументаИБ = Номер;
	Стр.ТипСсылки = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Транспортная Накладная");
	Стр.Организация = Организация;
	Стр.Проведен = Проведен;
	Стр.ПометкаУдаления = ПометкаУдаления;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|Пользователи.Ссылка КАК Ответственный,
	|Пользователи.Подразделение КАК Подразделение
	|ИЗ
	|Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|НЕ Пользователи.ПометкаУдаления
	|И Пользователи.ФизическоеЛицо = &ФизическоеЛицо
	|УПОРЯДОЧИТЬ ПО
	|Пользователи.Недействителен УБЫВ";
	Запрос.УстановитьПараметр("ФизическоеЛицо", Отпустил);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Стр.Ответственный = ВыборкаДетальныеЗаписи.Ответственный;
		Стр.Подразделение = ВыборкаДетальныеЗаписи.Подразделение;
	Иначе
		Стр.Ответственный = Справочники.Пользователи.ПустаяСсылка();
		Стр.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Грузополучатель) и ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Контрагенты")  Тогда
		Стр.Контрагент = Грузополучатель;
		Стр.Партнер = Грузополучатель.Партнер;
	Иначе
		Стр.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Стр.Партнер = Справочники.Партнеры.ПустаяСсылка();
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ТаблицыДляДвижений") Тогда
		ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРеестрДокументов", ТаблицаРеестрДокументов);
	Иначе
		ТаблицыДляДвижений = новый Структура;
		ТаблицыДляДвижений.Вставить("ТаблицаРеестрДокументов", ТаблицаРеестрДокументов);
		ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", ТаблицыДляДвижений);	
	КонецЕсли;
	
	РегистрыСведений.РеестрДокументов.ЗаписатьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ);
КонецПроцедуры


#Область Прочее

Процедура ДокументыОснованияИмеютВерныйСпособДоставки(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Шапка.Ссылка КАК Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоСпособовДоставкиБезИспользованияЗаданияНаПеревозку,
	|	СУММА(ВЫБОР
	|			КОГДА Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоСпособовДоставкиСИспользованиемЗаданияНаПеревозку,
	|	ИСТИНА КАК МожетИспользоватьсяДоставка
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&МассивСсылок)
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка
	|
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Шапка.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&МассивСсылок)
	|	И НЕ Шапка.РеализацияПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ДокументТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДокументТовары.ЗаказКлиента.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивСсылок)
	|	И ДокументТовары.Ссылка.РеализацияПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Ссылка,
	|	1,
	|	0,
	|	ЛОЖЬ
	|ИЗ
	|	Документ.КорректировкаРеализации КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&МассивСсылок)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Шапка.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА Шапка.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК Шапка
	|ГДЕ
	|	Шапка.Ссылка В(&МассивСсылок)
	|	И НЕ Шапка.ПеремещениеПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	Шапка.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ ДокументТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДокументТовары.ЗаказНаПеремещение.СпособДоставки В (&СпособыДоставкиСНашимУчастием)
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ИСТИНА
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка В(&МассивСсылок)
	|	И ДокументТовары.Ссылка.ПеремещениеПоЗаказам
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументТовары.Ссылка";
	
	ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками = 
		ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками");
	СпособыДоставкиСНашимУчастием = ДоставкаТоваровКлиентСервер.СпособыДоставкиДоКлиентаСНашимУчастием(
										ИспользоватьЗаданияНаПеревозкуДляУчетаДоставкиПеревозчиками);
	
	Запрос.УстановитьПараметр("МассивСсылок", ДокументыОснования.ВыгрузитьКолонку("ДокументОснование"));
	Запрос.УстановитьПараметр("СпособыДоставкиСНашимУчастием", СпособыДоставкиСНашимУчастием);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаданиеНаПеревозкуЗаполнено = ЗначениеЗаполнено(ЗаданиеНаПеревозку);
	
	ШаблонСообщенияСДоставкой = НСтр("ru = 'По документу ""%Документ%"" не предусмотрена доставка, поэтому данный документ не может являться основанием транспортной накладной, связанной с заданием на перевозку.'");
	ШаблонСообщенияБезДоставки = НСтр("ru = 'По документу ""%Документ%"" предусмотрена доставка, поэтому данный документ не может являться основанием транспортной накладной, не связанной с заданием на перевозку.'");
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ТекстСообщения = "";
		
		Если (РезультатЗапроса.КоличествоСпособовДоставкиСИспользованиемЗаданияНаПеревозку = 0)
			И ЗаданиеНаПеревозкуЗаполнено Тогда
			ТекстСообщения = ШаблонСообщенияСДоставкой;
		ИначеЕсли (РезультатЗапроса.КоличествоСпособовДоставкиБезИспользованияЗаданияНаПеревозку = 0)
			И НЕ ЗаданиеНаПеревозкуЗаполнено Тогда
			ТекстСообщения = ШаблонСообщенияБезДоставки;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ТекстСообщения) Тогда
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", РезультатЗапроса.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, РезультатЗапроса.Ссылка,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДокументыОснованияИмеютНоменклатуруТипаТовар(Отказ)
	
	МассивВсехРаспоряжений = ДокументыОснования.ВыгрузитьКолонку("ДокументОснование");
	МассивРаспоряженийСТоварами = Документы.ТранспортнаяНакладная.ПолучитьТолькоДокументыОснованияСТоварами(МассивВсехРаспоряжений, Отказ);
		
КонецПроцедуры

Процедура ЗаполнитьДанныеВыбора(Элемент)
	Водитель = Элемент.Владелец;
	АвтомобильГосударственныйНомер = Элемент.АвтомобильНомер;
	АвтомобильМарка = Элемент.АвтомобильМарка;
	Перевозчик = Элемент.Контрагент;
	УдостоверениеСерия = Элемент.УдостоверениеСерия;
	УдостоверениеНомер = Элемент.УдостоверениеНомер;
	ВидПеревозки = "Грузовая";
	БанковскийСчетПеревозчика = Элемент.БанковскийСчетКонтрагента;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура асп_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ДанныеЗаполнения <> Неопределено Тогда

		ДокументыОснованияМассив = Новый Массив;

		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ДокументОснование") Тогда
			ДокументыОснованияМассив.Добавить(ДанныеЗаполнения.ДокументОснование);
		Иначе
			ДокументыОснованияМассив.Добавить(ДанныеЗаполнения);
		КонецЕсли;

		Документы.ТранспортнаяНакладная.СоздатьТранспортныеНакладные(ДокументыОснованияМассив,,ЭтотОбъект);

	КонецЕсли;

	ИнициализироватьДокумент(ДанныеЗаполнения);
#Вставка

	//ГТС Начало заполнения водителя
	ЕСЛИ НЕ ЗначениеЗаполнено(Водитель) ТОГДА
		Для каждого СтрокаТЧ ИЗ ДокументыОснования
			Цикл
			Если ТипЗнч(СтрокаТЧ.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") И 
				СтрокаТЧ.ДокументОснование.ЗаявкаНаТранспорт <> Документы.ЗаявкаНаТранспорт.ПустаяСсылка()
				Тогда

				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ВодителиГТС.Ссылка,
				|	ВодителиГТС.Владелец
				|ИЗ
				|	Справочник.ВодителиГТС КАК ВодителиГТС
				|ГДЕ
				|	ВодителиГТС.Владелец = &Владелец И НЕ ПометкаУдаления";
				Запрос.УстановитьПараметр("Владелец", СтрокаТЧ.ДокументОснование.ЗаявкаНаТранспорт.Водитель);
				РезультатЗапроса = Запрос.Выполнить();

				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Сч=0;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Сч=1;
					ЗаполнитьДанныеВыбора(ВыборкаДетальныеЗаписи.Ссылка);
				КонецЦикла;
				Если Сч>0 Тогда
					АдресДоставки = СтрокаТЧ.ДокументОснование.ЗаявкаНаТранспорт.Город + ", " + СтрокаТЧ.ДокументОснование.ЗаявкаНаТранспорт.АдресДоставки;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//ГТС конец заполнения водителя

#КонецВставки
КонецПроцедуры


#КонецОбласти
